//BLIBALOC JOB (BCPL),'BLIB OBJ ALLOC',CLASS=A,MSGCLASS=A,
//             MSGLEVEL=(1,1)
//* RUN ONCE ONLY, AFTER VERIFYING DATA SET DOES NOT EXIST.
//* DO NOT SUBMIT IF HERC02.BCPL.OBJ ALREADY EXISTS.
//ALLOC    EXEC PGM=IEFBR14
//OBJ      DD DSN=HERC02.BCPL.OBJ,DISP=(NEW,CATLG,DELETE),
//             UNIT=SYSDA,SPACE=(TRK,(10,5,20)),
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=800),
//             DSORG=PO
//
