//CAMBBLD  JOB (BCPL),'CAMBRIDGE BUILD',CLASS=A,MSGCLASS=A,
//             USER=HERC02,PASSWORD=XXXXXXXX,
//             MSGLEVEL=(1,1)
//*
//* REPLACE XXXXXXXX WITH THE LOCAL HERC02 PASSWORD BEFORE SUBMISSION.
//* ALL INPUT MEMBERS MUST ALREADY HAVE BEEN POSITIONED BY DSPAL.
//*
//* PHASE 1 - BUILD A READY-TO-RUN ICINT V19 LOAD MODULE
//*
//ASM      EXEC PGM=IFOX00,
//             PARM='OBJECT,NODECK,NOLIST,NOXREF',REGION=256K
//SYSLIB   DD  DSN=SYS1.MACLIB,DISP=SHR
//SYSUT1   DD  UNIT=SYSDA,SPACE=(1700,(600,100))
//SYSUT2   DD  UNIT=SYSDA,SPACE=(1700,(300,50))
//SYSUT3   DD  UNIT=SYSDA,SPACE=(1700,(300,50))
//SYSPRINT DD  SYSOUT=*
//SYSPUNCH DD  DUMMY
//SYSGO    DD  DSN=&&ICOBJ,UNIT=SYSDA,SPACE=(80,(300,100)),
//             DISP=(NEW,PASS)
//SYSIN    DD  DSN=HERC02.BCPL.ASM(ICINT19),DISP=SHR
//*
//LKED     EXEC PGM=IEWL,PARM='LET,NCAL',REGION=256K,
//             COND=(4,LT,ASM)
//SYSLIN   DD  DSN=&&ICOBJ,DISP=(OLD,DELETE)
//         DD  *
  ENTRY ICINT
  NAME ICINT19(R)
/*
//SYSLMOD  DD  DSN=HERC02.BCPL.LOAD,DISP=SHR
//SYSUT1   DD  UNIT=SYSDA,SPACE=(1024,(50,20))
//SYSPRINT DD  SYSOUT=*
//*
//* PHASE 2 - COMPILE THE DEMOTED CAMBRIDGE COMPILER TO INTCODE
//*
//* BCPL -> HERC02.BCPL.INTCODE(BCPL)
//C01CMP  EXEC PGM=ICINT19,REGION=256K,TIME=(,30)
//STEPLIB  DD  DSN=HERC02.BCPL.LOAD,DISP=SHR
//SYSPRINT DD  SYSOUT=*,DCB=(RECFM=FB,LRECL=132,BLKSIZE=132)
//INTIN    DD  DSN=HERC02.BCPL.INTCODE(SYNI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(TRNILRG),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(BLIBI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(ICLIB),DISP=SHR
//SYSIN    DD  DSN=HERC02.BCPL.SOURCE(BCPL),DISP=SHR
//OPTIONS  DD  DSN=HERC02.BCPL.SOURCE(OPTIONS),DISP=SHR
//LIBHDR   DD  DSN=HERC02.BCPL.SOURCE(LIBHDR),DISP=SHR
//SYNHDR   DD  DSN=HERC02.BCPL.SOURCE(SYNHDR),DISP=SHR
//TRNHDR   DD  DSN=HERC02.BCPL.SOURCE(TRNHDR),DISP=SHR
//CGHDR    DD  DSN=HERC02.BCPL.SOURCE(CGHDR),DISP=SHR
//OCODE    DD  DSN=&&OC01,UNIT=SYSDA,SPACE=(80,(1000,500)),
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=80),
//             DISP=(NEW,PASS)
//SYSUDUMP DD  DUMMY
//*
//C01CG   EXEC PGM=ICINT19,REGION=256K,TIME=(,30)
//STEPLIB  DD  DSN=HERC02.BCPL.LOAD,DISP=SHR
//SYSPRINT DD  SYSOUT=*,DCB=(RECFM=FB,LRECL=132,BLKSIZE=132)
//INTIN    DD  DSN=HERC02.BCPL.INTCODE(CGI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(BLIBI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(ICLIB),DISP=SHR
//SYSIN    DD  DSN=&&OC01,DISP=(OLD,DELETE)
//INTCODE  DD  DSN=HERC02.BCPL.INTCODE(BCPL),DISP=SHR
//SYSUDUMP DD  DUMMY
//*
//* SYN -> HERC02.BCPL.INTCODE(SYN)
//C02CMP  EXEC PGM=ICINT19,REGION=256K,TIME=(,30)
//STEPLIB  DD  DSN=HERC02.BCPL.LOAD,DISP=SHR
//SYSPRINT DD  SYSOUT=*,DCB=(RECFM=FB,LRECL=132,BLKSIZE=132)
//INTIN    DD  DSN=HERC02.BCPL.INTCODE(SYNI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(TRNILRG),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(BLIBI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(ICLIB),DISP=SHR
//SYSIN    DD  DSN=HERC02.BCPL.SOURCE(SYN),DISP=SHR
//OPTIONS  DD  DSN=HERC02.BCPL.SOURCE(OPTIONS),DISP=SHR
//LIBHDR   DD  DSN=HERC02.BCPL.SOURCE(LIBHDR),DISP=SHR
//SYNHDR   DD  DSN=HERC02.BCPL.SOURCE(SYNHDR),DISP=SHR
//TRNHDR   DD  DSN=HERC02.BCPL.SOURCE(TRNHDR),DISP=SHR
//CGHDR    DD  DSN=HERC02.BCPL.SOURCE(CGHDR),DISP=SHR
//OCODE    DD  DSN=&&OC02,UNIT=SYSDA,SPACE=(80,(1000,500)),
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=80),
//             DISP=(NEW,PASS)
//SYSUDUMP DD  DUMMY
//*
//C02CG   EXEC PGM=ICINT19,REGION=256K,TIME=(,30)
//STEPLIB  DD  DSN=HERC02.BCPL.LOAD,DISP=SHR
//SYSPRINT DD  SYSOUT=*,DCB=(RECFM=FB,LRECL=132,BLKSIZE=132)
//INTIN    DD  DSN=HERC02.BCPL.INTCODE(CGI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(BLIBI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(ICLIB),DISP=SHR
//SYSIN    DD  DSN=&&OC02,DISP=(OLD,DELETE)
//INTCODE  DD  DSN=HERC02.BCPL.INTCODE(SYN),DISP=SHR
//SYSUDUMP DD  DUMMY
//*
//* LEX -> HERC02.BCPL.INTCODE(LEX)
//C03CMP  EXEC PGM=ICINT19,REGION=256K,TIME=(,30)
//STEPLIB  DD  DSN=HERC02.BCPL.LOAD,DISP=SHR
//SYSPRINT DD  SYSOUT=*,DCB=(RECFM=FB,LRECL=132,BLKSIZE=132)
//INTIN    DD  DSN=HERC02.BCPL.INTCODE(SYNI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(TRNILRG),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(BLIBI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(ICLIB),DISP=SHR
//SYSIN    DD  DSN=HERC02.BCPL.SOURCE(LEX),DISP=SHR
//OPTIONS  DD  DSN=HERC02.BCPL.SOURCE(OPTIONS),DISP=SHR
//LIBHDR   DD  DSN=HERC02.BCPL.SOURCE(LIBHDR),DISP=SHR
//SYNHDR   DD  DSN=HERC02.BCPL.SOURCE(SYNHDR),DISP=SHR
//TRNHDR   DD  DSN=HERC02.BCPL.SOURCE(TRNHDR),DISP=SHR
//CGHDR    DD  DSN=HERC02.BCPL.SOURCE(CGHDR),DISP=SHR
//OCODE    DD  DSN=&&OC03,UNIT=SYSDA,SPACE=(80,(1000,500)),
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=80),
//             DISP=(NEW,PASS)
//SYSUDUMP DD  DUMMY
//*
//C03CG   EXEC PGM=ICINT19,REGION=256K,TIME=(,30)
//STEPLIB  DD  DSN=HERC02.BCPL.LOAD,DISP=SHR
//SYSPRINT DD  SYSOUT=*,DCB=(RECFM=FB,LRECL=132,BLKSIZE=132)
//INTIN    DD  DSN=HERC02.BCPL.INTCODE(CGI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(BLIBI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(ICLIB),DISP=SHR
//SYSIN    DD  DSN=&&OC03,DISP=(OLD,DELETE)
//INTCODE  DD  DSN=HERC02.BCPL.INTCODE(LEX),DISP=SHR
//SYSUDUMP DD  DUMMY
//*
//* TRNA -> HERC02.BCPL.INTCODE(TRNA)
//C04CMP  EXEC PGM=ICINT19,REGION=256K,TIME=(,30)
//STEPLIB  DD  DSN=HERC02.BCPL.LOAD,DISP=SHR
//SYSPRINT DD  SYSOUT=*,DCB=(RECFM=FB,LRECL=132,BLKSIZE=132)
//INTIN    DD  DSN=HERC02.BCPL.INTCODE(SYNI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(TRNILRG),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(BLIBI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(ICLIB),DISP=SHR
//SYSIN    DD  DSN=HERC02.BCPL.SOURCE(TRNA),DISP=SHR
//OPTIONS  DD  DSN=HERC02.BCPL.SOURCE(OPTIONS),DISP=SHR
//LIBHDR   DD  DSN=HERC02.BCPL.SOURCE(LIBHDR),DISP=SHR
//SYNHDR   DD  DSN=HERC02.BCPL.SOURCE(SYNHDR),DISP=SHR
//TRNHDR   DD  DSN=HERC02.BCPL.SOURCE(TRNHDR),DISP=SHR
//CGHDR    DD  DSN=HERC02.BCPL.SOURCE(CGHDR),DISP=SHR
//OCODE    DD  DSN=&&OC04,UNIT=SYSDA,SPACE=(80,(1000,500)),
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=80),
//             DISP=(NEW,PASS)
//SYSUDUMP DD  DUMMY
//*
//C04CG   EXEC PGM=ICINT19,REGION=256K,TIME=(,30)
//STEPLIB  DD  DSN=HERC02.BCPL.LOAD,DISP=SHR
//SYSPRINT DD  SYSOUT=*,DCB=(RECFM=FB,LRECL=132,BLKSIZE=132)
//INTIN    DD  DSN=HERC02.BCPL.INTCODE(CGI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(BLIBI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(ICLIB),DISP=SHR
//SYSIN    DD  DSN=&&OC04,DISP=(OLD,DELETE)
//INTCODE  DD  DSN=HERC02.BCPL.INTCODE(TRNA),DISP=SHR
//SYSUDUMP DD  DUMMY
//*
//* TRNB -> HERC02.BCPL.INTCODE(TRNB)
//C05CMP  EXEC PGM=ICINT19,REGION=256K,TIME=(,30)
//STEPLIB  DD  DSN=HERC02.BCPL.LOAD,DISP=SHR
//SYSPRINT DD  SYSOUT=*,DCB=(RECFM=FB,LRECL=132,BLKSIZE=132)
//INTIN    DD  DSN=HERC02.BCPL.INTCODE(SYNI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(TRNILRG),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(BLIBI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(ICLIB),DISP=SHR
//SYSIN    DD  DSN=HERC02.BCPL.SOURCE(TRNB),DISP=SHR
//OPTIONS  DD  DSN=HERC02.BCPL.SOURCE(OPTIONS),DISP=SHR
//LIBHDR   DD  DSN=HERC02.BCPL.SOURCE(LIBHDR),DISP=SHR
//SYNHDR   DD  DSN=HERC02.BCPL.SOURCE(SYNHDR),DISP=SHR
//TRNHDR   DD  DSN=HERC02.BCPL.SOURCE(TRNHDR),DISP=SHR
//CGHDR    DD  DSN=HERC02.BCPL.SOURCE(CGHDR),DISP=SHR
//OCODE    DD  DSN=&&OC05,UNIT=SYSDA,SPACE=(80,(1000,500)),
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=80),
//             DISP=(NEW,PASS)
//SYSUDUMP DD  DUMMY
//*
//C05CG   EXEC PGM=ICINT19,REGION=256K,TIME=(,30)
//STEPLIB  DD  DSN=HERC02.BCPL.LOAD,DISP=SHR
//SYSPRINT DD  SYSOUT=*,DCB=(RECFM=FB,LRECL=132,BLKSIZE=132)
//INTIN    DD  DSN=HERC02.BCPL.INTCODE(CGI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(BLIBI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(ICLIB),DISP=SHR
//SYSIN    DD  DSN=&&OC05,DISP=(OLD,DELETE)
//INTCODE  DD  DSN=HERC02.BCPL.INTCODE(TRNB),DISP=SHR
//SYSUDUMP DD  DUMMY
//*
//* CGA -> HERC02.BCPL.INTCODE(CGA)
//C06CMP  EXEC PGM=ICINT19,REGION=256K,TIME=(,30)
//STEPLIB  DD  DSN=HERC02.BCPL.LOAD,DISP=SHR
//SYSPRINT DD  SYSOUT=*,DCB=(RECFM=FB,LRECL=132,BLKSIZE=132)
//INTIN    DD  DSN=HERC02.BCPL.INTCODE(SYNI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(TRNILRG),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(BLIBI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(ICLIB),DISP=SHR
//SYSIN    DD  DSN=HERC02.BCPL.SOURCE(CGA),DISP=SHR
//OPTIONS  DD  DSN=HERC02.BCPL.SOURCE(OPTIONS),DISP=SHR
//LIBHDR   DD  DSN=HERC02.BCPL.SOURCE(LIBHDR),DISP=SHR
//SYNHDR   DD  DSN=HERC02.BCPL.SOURCE(SYNHDR),DISP=SHR
//TRNHDR   DD  DSN=HERC02.BCPL.SOURCE(TRNHDR),DISP=SHR
//CGHDR    DD  DSN=HERC02.BCPL.SOURCE(CGHDR),DISP=SHR
//OCODE    DD  DSN=&&OC06,UNIT=SYSDA,SPACE=(80,(1000,500)),
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=80),
//             DISP=(NEW,PASS)
//SYSUDUMP DD  DUMMY
//*
//C06CG   EXEC PGM=ICINT19,REGION=256K,TIME=(,30)
//STEPLIB  DD  DSN=HERC02.BCPL.LOAD,DISP=SHR
//SYSPRINT DD  SYSOUT=*,DCB=(RECFM=FB,LRECL=132,BLKSIZE=132)
//INTIN    DD  DSN=HERC02.BCPL.INTCODE(CGI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(BLIBI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(ICLIB),DISP=SHR
//SYSIN    DD  DSN=&&OC06,DISP=(OLD,DELETE)
//INTCODE  DD  DSN=HERC02.BCPL.INTCODE(CGA),DISP=SHR
//SYSUDUMP DD  DUMMY
//*
//* CGB -> HERC02.BCPL.INTCODE(CGB)
//C07CMP  EXEC PGM=ICINT19,REGION=256K,TIME=(,30)
//STEPLIB  DD  DSN=HERC02.BCPL.LOAD,DISP=SHR
//SYSPRINT DD  SYSOUT=*,DCB=(RECFM=FB,LRECL=132,BLKSIZE=132)
//INTIN    DD  DSN=HERC02.BCPL.INTCODE(SYNI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(TRNILRG),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(BLIBI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(ICLIB),DISP=SHR
//SYSIN    DD  DSN=HERC02.BCPL.SOURCE(CGB),DISP=SHR
//OPTIONS  DD  DSN=HERC02.BCPL.SOURCE(OPTIONS),DISP=SHR
//LIBHDR   DD  DSN=HERC02.BCPL.SOURCE(LIBHDR),DISP=SHR
//SYNHDR   DD  DSN=HERC02.BCPL.SOURCE(SYNHDR),DISP=SHR
//TRNHDR   DD  DSN=HERC02.BCPL.SOURCE(TRNHDR),DISP=SHR
//CGHDR    DD  DSN=HERC02.BCPL.SOURCE(CGHDR),DISP=SHR
//OCODE    DD  DSN=&&OC07,UNIT=SYSDA,SPACE=(80,(1000,500)),
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=80),
//             DISP=(NEW,PASS)
//SYSUDUMP DD  DUMMY
//*
//C07CG   EXEC PGM=ICINT19,REGION=256K,TIME=(,30)
//STEPLIB  DD  DSN=HERC02.BCPL.LOAD,DISP=SHR
//SYSPRINT DD  SYSOUT=*,DCB=(RECFM=FB,LRECL=132,BLKSIZE=132)
//INTIN    DD  DSN=HERC02.BCPL.INTCODE(CGI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(BLIBI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(ICLIB),DISP=SHR
//SYSIN    DD  DSN=&&OC07,DISP=(OLD,DELETE)
//INTCODE  DD  DSN=HERC02.BCPL.INTCODE(CGB),DISP=SHR
//SYSUDUMP DD  DUMMY
//*
//* CGC -> HERC02.BCPL.INTCODE(CGC)
//C08CMP  EXEC PGM=ICINT19,REGION=256K,TIME=(,30)
//STEPLIB  DD  DSN=HERC02.BCPL.LOAD,DISP=SHR
//SYSPRINT DD  SYSOUT=*,DCB=(RECFM=FB,LRECL=132,BLKSIZE=132)
//INTIN    DD  DSN=HERC02.BCPL.INTCODE(SYNI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(TRNILRG),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(BLIBI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(ICLIB),DISP=SHR
//SYSIN    DD  DSN=HERC02.BCPL.SOURCE(CGC),DISP=SHR
//OPTIONS  DD  DSN=HERC02.BCPL.SOURCE(OPTIONS),DISP=SHR
//LIBHDR   DD  DSN=HERC02.BCPL.SOURCE(LIBHDR),DISP=SHR
//SYNHDR   DD  DSN=HERC02.BCPL.SOURCE(SYNHDR),DISP=SHR
//TRNHDR   DD  DSN=HERC02.BCPL.SOURCE(TRNHDR),DISP=SHR
//CGHDR    DD  DSN=HERC02.BCPL.SOURCE(CGHDR),DISP=SHR
//OCODE    DD  DSN=&&OC08,UNIT=SYSDA,SPACE=(80,(1000,500)),
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=80),
//             DISP=(NEW,PASS)
//SYSUDUMP DD  DUMMY
//*
//C08CG   EXEC PGM=ICINT19,REGION=256K,TIME=(,30)
//STEPLIB  DD  DSN=HERC02.BCPL.LOAD,DISP=SHR
//SYSPRINT DD  SYSOUT=*,DCB=(RECFM=FB,LRECL=132,BLKSIZE=132)
//INTIN    DD  DSN=HERC02.BCPL.INTCODE(CGI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(BLIBI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(ICLIB),DISP=SHR
//SYSIN    DD  DSN=&&OC08,DISP=(OLD,DELETE)
//INTCODE  DD  DSN=HERC02.BCPL.INTCODE(CGC),DISP=SHR
//SYSUDUMP DD  DUMMY
//*
//* CGD -> HERC02.BCPL.INTCODE(CGD)
//C09CMP  EXEC PGM=ICINT19,REGION=256K,TIME=(,30)
//STEPLIB  DD  DSN=HERC02.BCPL.LOAD,DISP=SHR
//SYSPRINT DD  SYSOUT=*,DCB=(RECFM=FB,LRECL=132,BLKSIZE=132)
//INTIN    DD  DSN=HERC02.BCPL.INTCODE(SYNI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(TRNILRG),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(BLIBI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(ICLIB),DISP=SHR
//SYSIN    DD  DSN=HERC02.BCPL.SOURCE(CGD),DISP=SHR
//OPTIONS  DD  DSN=HERC02.BCPL.SOURCE(OPTIONS),DISP=SHR
//LIBHDR   DD  DSN=HERC02.BCPL.SOURCE(LIBHDR),DISP=SHR
//SYNHDR   DD  DSN=HERC02.BCPL.SOURCE(SYNHDR),DISP=SHR
//TRNHDR   DD  DSN=HERC02.BCPL.SOURCE(TRNHDR),DISP=SHR
//CGHDR    DD  DSN=HERC02.BCPL.SOURCE(CGHDR),DISP=SHR
//OCODE    DD  DSN=&&OC09,UNIT=SYSDA,SPACE=(80,(1000,500)),
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=80),
//             DISP=(NEW,PASS)
//SYSUDUMP DD  DUMMY
//*
//C09CG   EXEC PGM=ICINT19,REGION=256K,TIME=(,30)
//STEPLIB  DD  DSN=HERC02.BCPL.LOAD,DISP=SHR
//SYSPRINT DD  SYSOUT=*,DCB=(RECFM=FB,LRECL=132,BLKSIZE=132)
//INTIN    DD  DSN=HERC02.BCPL.INTCODE(CGI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(BLIBI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(ICLIB),DISP=SHR
//SYSIN    DD  DSN=&&OC09,DISP=(OLD,DELETE)
//INTCODE  DD  DSN=HERC02.BCPL.INTCODE(CGD),DISP=SHR
//SYSUDUMP DD  DUMMY
//*
//* CGE -> HERC02.BCPL.INTCODE(CGE)
//C10CMP  EXEC PGM=ICINT19,REGION=256K,TIME=(,30)
//STEPLIB  DD  DSN=HERC02.BCPL.LOAD,DISP=SHR
//SYSPRINT DD  SYSOUT=*,DCB=(RECFM=FB,LRECL=132,BLKSIZE=132)
//INTIN    DD  DSN=HERC02.BCPL.INTCODE(SYNI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(TRNILRG),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(BLIBI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(ICLIB),DISP=SHR
//SYSIN    DD  DSN=HERC02.BCPL.SOURCE(CGE),DISP=SHR
//OPTIONS  DD  DSN=HERC02.BCPL.SOURCE(OPTIONS),DISP=SHR
//LIBHDR   DD  DSN=HERC02.BCPL.SOURCE(LIBHDR),DISP=SHR
//SYNHDR   DD  DSN=HERC02.BCPL.SOURCE(SYNHDR),DISP=SHR
//TRNHDR   DD  DSN=HERC02.BCPL.SOURCE(TRNHDR),DISP=SHR
//CGHDR    DD  DSN=HERC02.BCPL.SOURCE(CGHDR),DISP=SHR
//OCODE    DD  DSN=&&OC10,UNIT=SYSDA,SPACE=(80,(1000,500)),
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=80),
//             DISP=(NEW,PASS)
//SYSUDUMP DD  DUMMY
//*
//C10CG   EXEC PGM=ICINT19,REGION=256K,TIME=(,30)
//STEPLIB  DD  DSN=HERC02.BCPL.LOAD,DISP=SHR
//SYSPRINT DD  SYSOUT=*,DCB=(RECFM=FB,LRECL=132,BLKSIZE=132)
//INTIN    DD  DSN=HERC02.BCPL.INTCODE(CGI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(BLIBI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(ICLIB),DISP=SHR
//SYSIN    DD  DSN=&&OC10,DISP=(OLD,DELETE)
//INTCODE  DD  DSN=HERC02.BCPL.INTCODE(CGE),DISP=SHR
//SYSUDUMP DD  DUMMY
//*
//* BOOTHOST -> HERC02.BCPL.INTCODE(BOOTHOST)
//C11CMP  EXEC PGM=ICINT19,REGION=256K,TIME=(,30)
//STEPLIB  DD  DSN=HERC02.BCPL.LOAD,DISP=SHR
//SYSPRINT DD  SYSOUT=*,DCB=(RECFM=FB,LRECL=132,BLKSIZE=132)
//INTIN    DD  DSN=HERC02.BCPL.INTCODE(SYNI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(TRNILRG),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(BLIBI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(ICLIB),DISP=SHR
//SYSIN    DD  DSN=HERC02.BCPL.SOURCE(BOOTHOST),DISP=SHR
//OPTIONS  DD  DSN=HERC02.BCPL.SOURCE(OPTIONS),DISP=SHR
//LIBHDR   DD  DSN=HERC02.BCPL.SOURCE(LIBHDR),DISP=SHR
//SYNHDR   DD  DSN=HERC02.BCPL.SOURCE(SYNHDR),DISP=SHR
//TRNHDR   DD  DSN=HERC02.BCPL.SOURCE(TRNHDR),DISP=SHR
//CGHDR    DD  DSN=HERC02.BCPL.SOURCE(CGHDR),DISP=SHR
//OCODE    DD  DSN=&&OC11,UNIT=SYSDA,SPACE=(80,(1000,500)),
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=80),
//             DISP=(NEW,PASS)
//SYSUDUMP DD  DUMMY
//*
//C11CG   EXEC PGM=ICINT19,REGION=256K,TIME=(,30)
//STEPLIB  DD  DSN=HERC02.BCPL.LOAD,DISP=SHR
//SYSPRINT DD  SYSOUT=*,DCB=(RECFM=FB,LRECL=132,BLKSIZE=132)
//INTIN    DD  DSN=HERC02.BCPL.INTCODE(CGI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(BLIBI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(ICLIB),DISP=SHR
//SYSIN    DD  DSN=&&OC11,DISP=(OLD,DELETE)
//INTCODE  DD  DSN=HERC02.BCPL.INTCODE(BOOTHOST),DISP=SHR
//SYSUDUMP DD  DUMMY
//*
//* PHASE 3 - PACK THE COMPLETE ICINT-RUNNABLE CAMBRIDGE IMAGE
//*
//PACKCOMP EXEC PGM=IEBGENER
//SYSPRINT DD  SYSOUT=*
//SYSIN    DD  DUMMY
//SYSUT2   DD  DSN=HERC02.BCPL.INTCODE(CAMBCOMP),DISP=SHR
//SYSUT1   DD  DSN=HERC02.BCPL.INTCODE(BCPL),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(SYN),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(LEX),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(TRNA),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(TRNB),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(CGA),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(CGB),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(CGC),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(CGD),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(CGE),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(BOOTHOST),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(BLIBI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(ICLIB),DISP=SHR
//*
//* OUTPUT CHECKPOINT:
//*   HERC02.BCPL.LOAD(ICINT19)
//*   HERC02.BCPL.INTCODE(CAMBCOMP)
//*   PLUS THE INDIVIDUAL CAMBRIDGE INTCODE MEMBERS.
//
