//* CG370DB JOB BODY - BUILD DIAGNOSTIC CAMBRIDGE CG370 IMAGE
//* SUBMIT WITH: TOOLS/DSPAL SUBMIT JCL CG370DB --WAIT
//*
//* PREREQUISITES:
//*   CAMBBLD HAS ALREADY BUILT ICINT19 AND THE BASELINE CAMBRIDGE UNITS.
//*   DSPAL POPULATE SOURCE HAS INSTALLED CGAD/CGBD/CGCD/CGDD/CGED.
//*
//* THIS JOB DOES NOT REPLACE CAMBCOMP OR CGA-CGE.
//* IT COMPILES THE FIVE DIAGNOSTIC CG UNITS SEPARATELY, THEN PACKS
//* A COMPLETE ICINT-RUNNABLE COMPILER IMAGE AS INTCODE(CG370D).
//*
//* CGAD -> HERC02.BCPL.INTCODE(CGAD)
//D01CMP  EXEC PGM=ICINT19,REGION=256K,TIME=(,30)
//STEPLIB  DD  DSN=HERC02.BCPL.LOAD,DISP=SHR
//SYSPRINT DD  SYSOUT=*,DCB=(RECFM=FB,LRECL=132,BLKSIZE=132)
//INTIN    DD  DSN=HERC02.BCPL.INTCODE(SYNI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(TRNILRG),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(BLIBI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(ICLIB),DISP=SHR
//SYSIN    DD  DSN=HERC02.BCPL.SOURCE(CGAD),DISP=SHR
//OPTIONS  DD  DSN=HERC02.BCPL.SOURCE(OPTIONS),DISP=SHR
//LIBHDR   DD  DSN=HERC02.BCPL.SOURCE(LIBHDR),DISP=SHR
//SYNHDR   DD  DSN=HERC02.BCPL.SOURCE(SYNHDR),DISP=SHR
//TRNHDR   DD  DSN=HERC02.BCPL.SOURCE(TRNHDR),DISP=SHR
//CGHDR    DD  DSN=HERC02.BCPL.SOURCE(CGHDR),DISP=SHR
//OCODE    DD  DSN=&&OD01,UNIT=SYSDA,SPACE=(80,(1000,500)),
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=80),
//             DISP=(NEW,PASS)
//SYSUDUMP DD  DUMMY
//*
//D01CG   EXEC PGM=ICINT19,REGION=256K,TIME=(,30)
//STEPLIB  DD  DSN=HERC02.BCPL.LOAD,DISP=SHR
//SYSPRINT DD  SYSOUT=*,DCB=(RECFM=FB,LRECL=132,BLKSIZE=132)
//INTIN    DD  DSN=HERC02.BCPL.INTCODE(CGI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(BLIBI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(ICLIB),DISP=SHR
//SYSIN    DD  DSN=&&OD01,DISP=(OLD,DELETE)
//INTCODE  DD  DSN=HERC02.BCPL.INTCODE(CGAD),DISP=SHR
//SYSUDUMP DD  DUMMY
//*
//* CGBD -> HERC02.BCPL.INTCODE(CGBD)
//D02CMP  EXEC PGM=ICINT19,REGION=256K,TIME=(,30)
//STEPLIB  DD  DSN=HERC02.BCPL.LOAD,DISP=SHR
//SYSPRINT DD  SYSOUT=*,DCB=(RECFM=FB,LRECL=132,BLKSIZE=132)
//INTIN    DD  DSN=HERC02.BCPL.INTCODE(SYNI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(TRNILRG),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(BLIBI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(ICLIB),DISP=SHR
//SYSIN    DD  DSN=HERC02.BCPL.SOURCE(CGBD),DISP=SHR
//OPTIONS  DD  DSN=HERC02.BCPL.SOURCE(OPTIONS),DISP=SHR
//LIBHDR   DD  DSN=HERC02.BCPL.SOURCE(LIBHDR),DISP=SHR
//SYNHDR   DD  DSN=HERC02.BCPL.SOURCE(SYNHDR),DISP=SHR
//TRNHDR   DD  DSN=HERC02.BCPL.SOURCE(TRNHDR),DISP=SHR
//CGHDR    DD  DSN=HERC02.BCPL.SOURCE(CGHDR),DISP=SHR
//OCODE    DD  DSN=&&OD02,UNIT=SYSDA,SPACE=(80,(1000,500)),
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=80),
//             DISP=(NEW,PASS)
//SYSUDUMP DD  DUMMY
//*
//D02CG   EXEC PGM=ICINT19,REGION=256K,TIME=(,30)
//STEPLIB  DD  DSN=HERC02.BCPL.LOAD,DISP=SHR
//SYSPRINT DD  SYSOUT=*,DCB=(RECFM=FB,LRECL=132,BLKSIZE=132)
//INTIN    DD  DSN=HERC02.BCPL.INTCODE(CGI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(BLIBI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(ICLIB),DISP=SHR
//SYSIN    DD  DSN=&&OD02,DISP=(OLD,DELETE)
//INTCODE  DD  DSN=HERC02.BCPL.INTCODE(CGBD),DISP=SHR
//SYSUDUMP DD  DUMMY
//*
//* CGCD -> HERC02.BCPL.INTCODE(CGCD)
//D03CMP  EXEC PGM=ICINT19,REGION=256K,TIME=(,30)
//STEPLIB  DD  DSN=HERC02.BCPL.LOAD,DISP=SHR
//SYSPRINT DD  SYSOUT=*,DCB=(RECFM=FB,LRECL=132,BLKSIZE=132)
//INTIN    DD  DSN=HERC02.BCPL.INTCODE(SYNI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(TRNILRG),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(BLIBI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(ICLIB),DISP=SHR
//SYSIN    DD  DSN=HERC02.BCPL.SOURCE(CGCD),DISP=SHR
//OPTIONS  DD  DSN=HERC02.BCPL.SOURCE(OPTIONS),DISP=SHR
//LIBHDR   DD  DSN=HERC02.BCPL.SOURCE(LIBHDR),DISP=SHR
//SYNHDR   DD  DSN=HERC02.BCPL.SOURCE(SYNHDR),DISP=SHR
//TRNHDR   DD  DSN=HERC02.BCPL.SOURCE(TRNHDR),DISP=SHR
//CGHDR    DD  DSN=HERC02.BCPL.SOURCE(CGHDR),DISP=SHR
//OCODE    DD  DSN=&&OD03,UNIT=SYSDA,SPACE=(80,(1000,500)),
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=80),
//             DISP=(NEW,PASS)
//SYSUDUMP DD  DUMMY
//*
//D03CG   EXEC PGM=ICINT19,REGION=256K,TIME=(,30)
//STEPLIB  DD  DSN=HERC02.BCPL.LOAD,DISP=SHR
//SYSPRINT DD  SYSOUT=*,DCB=(RECFM=FB,LRECL=132,BLKSIZE=132)
//INTIN    DD  DSN=HERC02.BCPL.INTCODE(CGI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(BLIBI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(ICLIB),DISP=SHR
//SYSIN    DD  DSN=&&OD03,DISP=(OLD,DELETE)
//INTCODE  DD  DSN=HERC02.BCPL.INTCODE(CGCD),DISP=SHR
//SYSUDUMP DD  DUMMY
//*
//* CGDD -> HERC02.BCPL.INTCODE(CGDD)
//D04CMP  EXEC PGM=ICINT19,REGION=256K,TIME=(,30)
//STEPLIB  DD  DSN=HERC02.BCPL.LOAD,DISP=SHR
//SYSPRINT DD  SYSOUT=*,DCB=(RECFM=FB,LRECL=132,BLKSIZE=132)
//INTIN    DD  DSN=HERC02.BCPL.INTCODE(SYNI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(TRNILRG),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(BLIBI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(ICLIB),DISP=SHR
//SYSIN    DD  DSN=HERC02.BCPL.SOURCE(CGDD),DISP=SHR
//OPTIONS  DD  DSN=HERC02.BCPL.SOURCE(OPTIONS),DISP=SHR
//LIBHDR   DD  DSN=HERC02.BCPL.SOURCE(LIBHDR),DISP=SHR
//SYNHDR   DD  DSN=HERC02.BCPL.SOURCE(SYNHDR),DISP=SHR
//TRNHDR   DD  DSN=HERC02.BCPL.SOURCE(TRNHDR),DISP=SHR
//CGHDR    DD  DSN=HERC02.BCPL.SOURCE(CGHDR),DISP=SHR
//OCODE    DD  DSN=&&OD04,UNIT=SYSDA,SPACE=(80,(1000,500)),
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=80),
//             DISP=(NEW,PASS)
//SYSUDUMP DD  DUMMY
//*
//D04CG   EXEC PGM=ICINT19,REGION=256K,TIME=(,30)
//STEPLIB  DD  DSN=HERC02.BCPL.LOAD,DISP=SHR
//SYSPRINT DD  SYSOUT=*,DCB=(RECFM=FB,LRECL=132,BLKSIZE=132)
//INTIN    DD  DSN=HERC02.BCPL.INTCODE(CGI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(BLIBI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(ICLIB),DISP=SHR
//SYSIN    DD  DSN=&&OD04,DISP=(OLD,DELETE)
//INTCODE  DD  DSN=HERC02.BCPL.INTCODE(CGDD),DISP=SHR
//SYSUDUMP DD  DUMMY
//*
//* CGED -> HERC02.BCPL.INTCODE(CGED)
//D05CMP  EXEC PGM=ICINT19,REGION=256K,TIME=(,30)
//STEPLIB  DD  DSN=HERC02.BCPL.LOAD,DISP=SHR
//SYSPRINT DD  SYSOUT=*,DCB=(RECFM=FB,LRECL=132,BLKSIZE=132)
//INTIN    DD  DSN=HERC02.BCPL.INTCODE(SYNI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(TRNILRG),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(BLIBI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(ICLIB),DISP=SHR
//SYSIN    DD  DSN=HERC02.BCPL.SOURCE(CGED),DISP=SHR
//OPTIONS  DD  DSN=HERC02.BCPL.SOURCE(OPTIONS),DISP=SHR
//LIBHDR   DD  DSN=HERC02.BCPL.SOURCE(LIBHDR),DISP=SHR
//SYNHDR   DD  DSN=HERC02.BCPL.SOURCE(SYNHDR),DISP=SHR
//TRNHDR   DD  DSN=HERC02.BCPL.SOURCE(TRNHDR),DISP=SHR
//CGHDR    DD  DSN=HERC02.BCPL.SOURCE(CGHDR),DISP=SHR
//OCODE    DD  DSN=&&OD05,UNIT=SYSDA,SPACE=(80,(1000,500)),
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=80),
//             DISP=(NEW,PASS)
//SYSUDUMP DD  DUMMY
//*
//D05CG   EXEC PGM=ICINT19,REGION=256K,TIME=(,30)
//STEPLIB  DD  DSN=HERC02.BCPL.LOAD,DISP=SHR
//SYSPRINT DD  SYSOUT=*,DCB=(RECFM=FB,LRECL=132,BLKSIZE=132)
//INTIN    DD  DSN=HERC02.BCPL.INTCODE(CGI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(BLIBI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(ICLIB),DISP=SHR
//SYSIN    DD  DSN=&&OD05,DISP=(OLD,DELETE)
//INTCODE  DD  DSN=HERC02.BCPL.INTCODE(CGED),DISP=SHR
//SYSUDUMP DD  DUMMY
//*
//* PACK BASELINE FRONT END + DIAGNOSTIC CG INTO CG370D
//PACKDIAG EXEC PGM=IEBGENER
//SYSPRINT DD  SYSOUT=*
//SYSIN    DD  DUMMY
//SYSUT2   DD  DSN=HERC02.BCPL.INTCODE(CG370D),DISP=SHR
//SYSUT1   DD  DSN=HERC02.BCPL.INTCODE(BCPL),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(SYN),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(LEX),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(TRNA),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(TRNB),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(CGAD),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(CGBD),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(CGCD),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(CGDD),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(CGED),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(BOOTHOST),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(BLIBI),DISP=SHR
//         DD  DSN=HERC02.BCPL.INTCODE(ICLIB),DISP=SHR
