//DUMPJES  JOB (ACCT),'DUMP JES2 PARMS',CLASS=A,MSGCLASS=A,
//             MSGLEVEL=(1,1)
//DUMP     EXEC PGM=IEBPTPCH
//SYSPRINT DD SYSOUT=*
//SYSUT1   DD DSN=SYS1.JES2PARM,DISP=SHR
//SYSUT2   DD SYSOUT=*
//SYSIN    DD *
 PRINT TYPORG=PO,MAXNAME=8
 MEMBER NAME=JES2PARM
 MEMBER NAME=STARTSTD
/*

