//LISTPARM JOB (ACCT),'LIST PARMLIB',CLASS=A,MSGCLASS=A,
//             MSGLEVEL=(1,1)
//LIST     EXEC PGM=IEHLIST
//SYSPRINT DD SYSOUT=*
//DD1      DD UNIT=SYSDA,VOL=SER=TK5RES,DISP=OLD
//SYSIN    DD *
 LISTPDS DSNAME=SYS1.PARMLIB,VOL=SYSDA=TK5RES
/*

